In [1]:
import pandas as pd
import numpy as np

In [2]:
sub = pd.read_csv('submission.csv')
sub_ex = pd.read_csv('submission_example.csv')

In [3]:
sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12480 entries, 0 to 12479
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   row_id  12480 non-null  int64
 1   target  12480 non-null  float64
dtypes: float64(1), int64(1)
memory usage: 195.1 KB

In [4]:
sub_ex.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12480 entries, 0 to 12479
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   row_id  12480 non-null  int64
 1   target  12480 non-null  float64
dtypes: float64(1), int64(1)
memory usage: 195.1 KB

In [7]:
sub.nunique()

row_id    12480
target    10849
dtype: int64

In [8]:
sub_ex.nunique()

row_id    12480
target    12480
dtype: int64

In [10]:
sub.isna().sum()

row_id    0
target    0
dtype: int64

In [11]:
sub.describe()

             row_id        target
count  1.248000e+04  12480.000000
mean   2.012112e+06    243.299548
std    3.602810e+03    502.924040
min    2.005872e+06      0.000000
25%    2.008992e+06     40.656802
50%    2.012112e+06     92.710238
75%    2.015231e+06    246.221980
max    2.018351e+06   4846.847148

In [17]:
sub_ex.describe()

             row_id        target
count  1.248000e+04  12480.000000
mean   2.012112e+06    354.144095
std    3.602810e+03    918.847905
min    2.005872e+06      0.000007
25%    2.008992e+06     10.224228
50%    2.012112e+06     67.427751
75%    2.015231e+06    283.412911
max    2.018351e+06   9790.252066

In [16]:
for i in range(1, 11):
    print(i)
    # condition to skip iteration
    # Don't print multiplication table of even numbers
    if i % 2 == 0:
        continue
    print('Multiplication table of', i)
    for j in range(1, 11):
        print(i * j, end=' ')
    print('')

1
Multiplication table of 1
1 2 3 4 5 6 7 8 9 10
2
3
Multiplication table of 3
3 6 9 12 15 18 21 24 27 30
4
5
Multiplication table of 5
5 10 15 20 25 30 35 40 45 50
6
7
Multiplication table of 7
7 14 21 28 35 42 49 56 63 70
8
9
Multiplication table of 9
9 18 27 36 45 54 63 72 81 90
10

In [18]:
import pandas as pd

data = {'Group': ['A', 'A', 'A', 'B', 'B', 'B'],
        'Value': [1, 2, 3, 10, 20, 30]}
df = pd.DataFrame(data)
df

  Group  Value
0     A      1
1     A      2
2     A      3
3     B     10
4     B     20
5     B     30

In [19]:
df['Shifted_Value'] = df.groupby('Group')['Value'].shift()
# df['Shifted_Value'] = df.groupby('Group')['Value'].shift().fillna(0)
df

  Group  Value  Shifted_Value
0     A      1            NaN
1     A      2            1.0
2     A      3            2.0
3     B     10            NaN
4     B     20           10.0
5     B     30           20.0